app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" ORDER BY "todos"."created_at" DESC
---
  def index
    @filter = params[:filter] || "all"
    @todos = Todo.by_filter(@filter).order(created_at: :desc)

INSERT INTO "todos" ("title", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "New Todo"], ["completed", 0], ["created_at", "2026-03-17 18:53:49.588079"], ["updated_at", "2026-03-17 18:53:49.588079"]]
SELECT "todos".* FROM "todos" ORDER BY "todos"."created_at" DESC
---
  def create
    @todo = Todo.new(todo_params)
    if @todo.save
      redirect_to todos_path(filter: params[:filter])
    else
      @filter = params[:filter] || "all"
      @todos = Todo.by_filter(@filter).order(created_at: :desc)

UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2026-03-17 18:53:49.531365"], ["id", 980190963]]
---
  def update
    @todo.update(todo_params)